doc: Replace Graphviz diagrams with Mermaid
