--- a/docs/introduction/engineering.md
+++ b/docs/introduction/engineering.md
@@ -41,20 +41,12 @@ The scientific method involves making observations, formulating hypotheses based
 running experiments to falsify the hypotheses, and generalizing hypotheses into a cohesive theory.
 These activities form a loop:
 
-```dot process
-digraph scientific_method {
-  size="6!";
-  layout="circo";
-  splines="curved";
-  node [shape=rect, style="rounded,filled", fixedsize=true, width=1.5, height=0.75, fillcolor=lightskyblue2,
-    color=steelblue4, penwidth=2];
-  edge [fontsize=11, color=steelblue4, penwidth=2];
-
-  Experiment -> Observation [label = "\n\nPerform the\nexperiment"];
-  Observation -> Theory [label = "Create or modify\nthe theory"];
-  Theory -> Hypothesis [label = "Use the theory\nto form a\nhypothesis"];
-  Hypothesis -> Experiment [label = "Design an\nexperiment to\ntest the hypothesis"];
-}
+```mermaid
+flowchart LR
+  Experiment --Perform the\nexperiment--- Observation
+  Observation --Create or modify\nthe theory--- Theory
+  Theory --Use the theory\nto form a\nhypothesis--- Hypothesis
+  Hypothesis --Design an\nexperiment to\ntest the hypothesis--- Experiment
 ```
 
 Scientific knowledge grows over time.
