--- a/docs/introduction/software.md
+++ b/docs/introduction/software.md
@@ -228,14 +221,13 @@ Context-free languages can recognize programming languages.
 A parse tree of a CFG for a programming language describes a single program in that language.
 For instance, here's a fictitional parse tree for the infamous $Hello, world!$ program in C:
 
-```dot process
-graph parse_tree {
-  Program -- Function -- Declaration -- TypeSpecifier -- "int"
-  Function -- CompoundStatement -- Statement -- ExpressionStatement -- CallExpression -- Identifier -- "printf"
-  CallExpression -- StringLiteral
+```mermaid
+graph TB
+  Program --- Function --- Declaration --- TypeSpecifier --- int
+  Function --- CompoundStatement --- Statement --- ExpressionStatement --- CallExpression --- Identifier --- printf
+  CallExpression --- StringLiteral
 
-  StringLiteral [label="\"Hello, world!\""]
-}
+  StringLiteral["&quot;Hello, world!&quot;"]
 ```
 
 We now have the vocabulary to describe the _structure_ of a program and of programming languages.
